{
  "Version": 5,
  "GeneratedUTC": "2025-12-14T05:37:08Z",
  "Systems": [
    {
      "ID": "propulsion",
      "Name": "Propulsion",
      "Description": "Warp, impulse, maneuvering thrusters, inertial management.",
      "SortOrder": 10,
      "SidebarText": "Warp, impulse, maneuvering thrusters, inertial management.\n\nFeatured: Warp drive\n\nNotes:\n• Warp operation depends on stable warp field geometry; asymmetry or coil imbalance can force a shutdown.\n• High warp output competes with other ship systems for power; emergency routing is common during combat or damage control.\n• Warp travel can be unsafe or impossible in certain spatial anomalies, dense fields, or subspace‑distorted regions."
    }
  ],
  "Technologies": [
    {
      "ID": "st-warp-drive",
      "Name": "Warp drive",
      "SystemID": "propulsion",
      "Type": "Device",
      "Summary": "Warp drive is the core faster‑than‑light propulsion technology used by most interstellar powers in Star Trek. Rather than treating speed as simple acceleration through normal space, warp travel is framed as controlled field generation: a ship produces a shaped warp field—often described as a subspace bubble—that allows sustained superluminal transit between stars.\n\nBecause warp is an operating mode rather than a single component, a complete “warp drive” entry naturally spans the ship’s power reactor (the warp core and its matter/antimatter reaction system), distribution hardware (plasma/EPS pathways), and the field projectors (warp coils in the nacelles) that form and stabilize the warp field.",
      "Sections": {
        "What warp drive is": "Warp drive (sometimes called a warp engine) enables faster‑than‑light travel by generating warp fields around a vessel. The field is described as a subspace‑related effect that envelops the ship, allowing interstellar distances to be crossed in practical time. On the bridge, warp performance is communicated using warp factors (“warp six,” “warp 9.2”), which function as an operational shorthand for the field settings required to achieve a given effective velocity.\n\nAcross eras, the franchise keeps the same recognizable idea—warp fields, warp factors, nacelles, and a warp core—while letting specific details vary by ship class and period.",
        "Warp field and the subspace bubble": "On-screen dialogue repeatedly treats the warp field as a shaped structure that must remain stable: crews diagnose field asymmetry, harmonics, and other stability problems rather than simply “losing speed.” The common implication is that the ship is riding inside a controlled field configuration (often called a warp bubble or subspace bubble) that permits superluminal transit.\n\nThis framing is useful for storytelling because it makes warp travel adjustable and fallible. A ship can be forced out of warp by field instability, interference, or damage to the hardware that generates and regulates the field—without requiring that the entire ship be physically destroyed.",
        "The warp core and the matter/antimatter reaction": "Federation starships are most often portrayed as powering warp operations with a controlled matter/antimatter reaction in the warp core’s reaction assembly. Matter and antimatter are injected into a central reaction region in a regulated intermix ratio, releasing enormous energy. Dilithium is consistently referenced as a key element in moderating and regulating that reaction so energy can be safely drawn for ship systems.\n\nThe warp core is therefore both propulsion-critical and ship-critical: it’s treated as the heart of the vessel’s energy budget, with stability, containment, and shutdown procedures forming a constant part of engineering life.",
        "Nacelles, warp coils, and field generation": "While the core produces the power and reaction control, the ship’s warp nacelles are repeatedly framed as the field‑generation hardware. Warp coils (field coils) housed in the nacelles are fed by the core’s output—commonly described as plasma routed through conduits—and then used to project and shape the warp field.\n\nThis is why nacelles are treated as essential systems: damage to a nacelle, coil assembly, or the plasma feed can produce immediate warp‑field problems even if the core remains intact.",
        "Warp factors and performance": "Warp speed is expressed as a warp factor. Warp one marks the light‑speed threshold for warp travel, and higher factors represent increasingly greater effective velocities. The franchise is not perfectly consistent about mapping warp factor to a single numeric “times light speed” value, but it is consistently portrayed as non‑linear—small changes near the top end are treated as major jumps in performance and stress.\n\nIn practical terms, warp factor is the language the crew uses to communicate intent (“make best speed,” “maximum warp,” “warp nine”) while the computer and engineering systems handle the underlying field geometry, power routing, and safety margins.",
        "Operations, safeties, and failure modes": "Warp operation is depicted as a balance between power, stability, and structural limits. Common operational themes include rerouting power, balancing flow between nacelles, tuning field harmonics, isolating damaged conduits, and executing emergency shutdowns.\n\nCommonly referenced failure risks include containment loss or a core breach, field collapse due to coil damage or imbalance, and cascading power tradeoffs where maintaining warp conflicts with shields, weapons, or critical life support. These risks keep warp drive grounded as an engineered system with real procedures rather than a purely magical travel button.",
        "Environmental impact and speed limits": "A notable 24th‑century concern raised on screen is cumulative subspace damage linked to sustained high‑warp travel in certain regions. In response, Starfleet institutes a warp speed restriction (a “speed limit”) with emergency exceptions, emphasizing that warp operation can have systemic consequences beyond an individual ship’s maintenance.\n\nLater stories treat the restriction as temporary or unevenly applied, but the episode establishes an enduring idea: warp drive is powerful enough to create environmental side effects under the right conditions.",
        "History and development": "Human warp history is anchored by Zefram Cochrane’s first successful warp flight, which becomes a turning point leading directly to first contact with the Vulcans. From there, Starfleet warp systems advance from early, more limited reactors to the mature 23rd‑ and 24th‑century architectures built around high‑output warp cores, nacelle coil systems, and increasingly refined control and safety layers.\n\nDifferent cultures field different design approaches—some emphasizing stealth, speed, or alternative superluminal methods—so “warp drive” also sits inside a larger family of faster‑than‑light technologies that include transwarp concepts and other specialized propulsion modes."
      },
      "RelatedTechIDs": [],
      "Appearances": [
        {
          "RefType": "Episode",
          "Series": "TOS",
          "Title": "The Cage",
          "Season": 1,
          "Episode": 0,
          "Notes": "Early on-screen use of warp factor terminology."
        },
        {
          "RefType": "Episode",
          "Series": "TNG",
          "Title": "Booby Trap",
          "Season": 3,
          "Episode": 6,
          "Notes": "Warp core/propulsion referenced in engineering context."
        },
        {
          "RefType": "Episode",
          "Series": "TNG",
          "Title": "Relics",
          "Season": 6,
          "Episode": 4,
          "Notes": "Engineering focus; dilithium chamber imagery and warp power concerns feature prominently."
        },
        {
          "RefType": "Episode",
          "Series": "TNG",
          "Title": "Force of Nature",
          "Season": 7,
          "Episode": 9,
          "Notes": "Introduces subspace damage concern and a warp speed restriction policy."
        },
        {
          "RefType": "Film",
          "Series": "Film",
          "Title": "Star Trek: First Contact",
          "Season": null,
          "Episode": null,
          "Notes": "Cochrane’s warp flight is central to the setting and first contact."
        },
        {
          "RefType": "Episode",
          "Series": "ENT",
          "Title": "First Flight",
          "Season": 2,
          "Episode": 24,
          "Notes": "Revisits early Human warp development and Cochrane’s legacy."
        },
        {
          "RefType": "Episode",
          "Series": "VOY",
          "Title": "Threshold",
          "Season": 2,
          "Episode": 15,
          "Notes": "Explores an extreme warp performance edge case in-story."
        }
      ],
      "Variants": [
        {
          "Name": "Transwarp (umbrella term)",
          "Summary": "A label applied to multiple faster‑than‑warp approaches intended to exceed traditional warp drive limits; depicted differently by different species."
        },
        {
          "Name": "Variable‑geometry nacelles (selected Starfleet designs)",
          "Summary": "A starship design feature depicted as altering nacelle configuration during warp operations, tied in dialogue to managing field effects."
        }
      ],
      "KeyTerms": [
        {
          "Term": "Warp field",
          "Definition": "The shaped field generated for warp travel; stability and geometry are recurring operational concerns."
        },
        {
          "Term": "Subspace bubble",
          "Definition": "Common description of the field structure that envelops a ship during warp transit."
        },
        {
          "Term": "Warp factor",
          "Definition": "The operational scale used to communicate warp performance settings (e.g., “warp six”)."
        },
        {
          "Term": "Warp core",
          "Definition": "Primary ship reactor associated with warp propulsion; commonly a matter/antimatter reaction system in Federation designs."
        },
        {
          "Term": "M/ARA",
          "Definition": "Matter/Antimatter Reaction Assembly; the reactor arrangement that injects matter and antimatter into a controlled reaction element."
        },
        {
          "Term": "Dilithium chamber",
          "Definition": "Core component housing dilithium crystals used in regulating the matter/antimatter reaction."
        },
        {
          "Term": "Warp nacelle",
          "Definition": "External housing containing warp coils used to generate and shape the warp field."
        },
        {
          "Term": "Warp coil",
          "Definition": "Field coil assemblies within nacelles that project the warp field when energized."
        },
        {
          "Term": "Core breach",
          "Definition": "Catastrophic failure mode involving loss of containment/control of the warp core reaction."
        }
      ],
      "Operators": [
        "Starfleet (Federation starships)",
        "Major interstellar powers with warp-capable vessels"
      ],
      "Constraints": [
        "Warp operation depends on stable warp field geometry; asymmetry or coil imbalance can force a shutdown.",
        "High warp output competes with other ship systems for power; emergency routing is common during combat or damage control.",
        "Warp travel can be unsafe or impossible in certain spatial anomalies, dense fields, or subspace‑distorted regions.",
        "Matter/antimatter containment is existential; loss of containment is treated as catastrophic.",
        "Sustained high‑warp activity is depicted as having potential environmental side effects in sensitive regions."
      ],
      "Meta": {
        "Series": [
          "ENT",
          "TOS",
          "TAS",
          "TNG",
          "DS9",
          "VOY",
          "FILM",
          "PIC",
          "SNW",
          "LDS",
          "PRO",
          "DIS"
        ],
        "Era": [
          "21st century",
          "22nd century",
          "23rd century",
          "24th century",
          "25th century",
          "32nd century"
        ],
        "Affiliations": [
          "United Federation of Planets",
          "Starfleet"
        ],
        "FirstSeen": "TOS: \"The Cage\" (warp factor terminology)",
        "LastSeen": ""
      },
      "Media": {
        "Image": "https://raw.githubusercontent.com/BigBird7827/Tec-Trek/main/Images/Warp%20Drive.png",
        "Gallery": []
      }
    },
    {
      "ID": "st-impulse-drive",
      "Name": "Impulse drive",
      "SystemID": "propulsion",
      "Type": "System",
      "Summary": "Impulse drive is the standard sublight propulsion mode used by starships for routine travel within a star system, close‑range navigation, docking approaches, formation flight, and tactical maneuvering. In practice, it’s the ship’s everyday “under normal space” engine: the setting you hear most often on the bridge—one‑quarter impulse, half impulse, or full impulse—when warp is unnecessary, unsafe, or simply the wrong tool.\n\nOn screen, impulse is consistently framed as a power‑regulated propulsion system integrated into the ship’s overall energy management. Captains call for changes in *impulse power* as readily as they call for shields or phasers, and engineering treats impulse as something that can be surged, rerouted, repaired, shut down, or pushed beyond safe limits in emergencies.",
      "Sections": {
        "What impulse drive is": "Impulse drive (often referred to as the ship’s impulse engines) provides sustained sublight thrust. It is used whenever a ship needs precise, controllable acceleration without engaging warp—leaving drydock, maneuvering in orbit, holding station, closing to transport range, or fighting at close quarters.\n\nImpulse is also an operational concept: bridge orders like “impulse power at your discretion,” “reduce impulse power,” or “full impulse” are treated as standardized shorthand for how hard the ship should push its sublight engines under current conditions.",
        "Impulse power and shipwide energy management": "Impulse is presented as a major consumer of a ship’s power budget. Dialogue frequently treats impulse output as something that can be raised, lowered, restored, or lost—sometimes independently of other systems. When a ship is damaged, crews may fight to get *impulse power* back online, reroute conduits, or manually restore the engine feed so the ship can maneuver or escape.\n\nThat framing matters for your database: impulse isn’t just “go fast.” In many stories, it’s the difference between being able to change position, hold orbit, break a tractor lock, or avoid impact—especially when warp is unavailable.",
        "Command language and operating modes": "Impulse is commonly expressed as a fraction of maximum (“one‑quarter impulse,” “half impulse,” “full impulse”). The shows don’t lock this to a single universal velocity; instead, it behaves like a bridge‑level throttle setting that accounts for ship class, mass, power availability, and safety constraints.\n\nTwo related concepts show up repeatedly:\n• **Reverse impulse** — the ship applies impulse thrust in reverse for braking, backing off, or holding position.\n• **Impulse at discretion** — the pilot or helmsman selects a safe output appropriate to the situation without needing a specific number.",
        "Use cases across the franchise": "Impulse drive dominates day‑to‑day operations. It’s the mode for in‑system travel and close‑range work: leaving spacedock, approaching a planet, rendezvousing with another vessel, or executing delicate maneuvers where warp fields would be hazardous.\n\nIt also shows up in “time pressure” situations: ships run at impulse inside systems to intercept threats or reach a destination quickly while still obeying whatever limits apply to warp travel in that environment.",
        "Tactical significance": "Most starship engagements are depicted at sublight scales: ships circle, exchange fire, line up torpedo shots, and reposition to protect a damaged area of shields. In that context, impulse performance is effectively the ship’s tactical mobility—how quickly it can bring weapons to bear, evade an attack run, or hold a defensive formation.\n\nDamage to impulse is therefore a serious tactical blow. When impulse drops offline, a ship can become a drifting target, unable to maintain distance or change heading effectively.",
        "Failure modes, stress, and emergency behavior": "Impulse engines are often portrayed as temperamental under damage or extreme demand: they can surge, cut out, overheat, or require emergency handling. Stories treat “pushing impulse” as something that can be risky—either because the engines are already compromised or because the ship is operating at the edge of what its structure and systems can safely support.\n\nIn the most extreme cases, impulse operation is linked to catastrophic outcomes: a damaged ship may risk blowing its impulse engines, or an engineering team may attempt to overload the system as part of a desperate plan.",
        "Visual identity and ship design cues": "Impulse drive is frequently represented visually by paired impulse engine ports or grilles on the aft portion of a ship’s main hull. These are distinct from warp nacelles and are treated as the visible “sublight engines.”\n\nEven when the exact geometry varies by era and class, the storytelling function is consistent: the impulse assembly signals sublight thrust and provides a recognizable cue for whether the ship is maneuvering under impulse rather than at warp.",
        "Relationship to warp, thrusters, and inertial control": "Impulse sits in a family of ship handling systems. Thrusters handle fine translation and attitude changes; impulse provides sustained thrust for travel and combat maneuvers; warp handles interstellar transit. In practice, these systems interlock—particularly with inertial management—because the ship must remain habitable and controllable under acceleration.\n\nThis is why impulse is repeatedly treated as more than a toggle: it’s a major operational mode that affects navigation, tactics, and the ship’s ability to function when other propulsion options are restricted."
      },
      "RelatedTechIDs": [
        "st-warp-drive"
      ],
      "Appearances": [
        {
          "RefType": "Film",
          "Series": "Film",
          "Title": "Star Trek: The Motion Picture",
          "Season": null,
          "Episode": null,
          "Notes": "Bridge orders treat impulse as the default mode within the solar system; the captain calls for impulse power and later risks engaging warp while still in-system."
        },
        {
          "RefType": "Film",
          "Series": "Film",
          "Title": "Star Trek II: The Wrath of Khan",
          "Season": null,
          "Episode": null,
          "Notes": "“Full impulse power” is used as an urgent command during the Mutara Nebula chase."
        },
        {
          "RefType": "Episode",
          "Series": "DS9",
          "Title": "Emissary",
          "Season": 1,
          "Episode": 1,
          "Notes": "Impulse power is discussed as something that can be reduced or lost unexpectedly while approaching Deep Space 9."
        },
        {
          "RefType": "Episode",
          "Series": "TNG",
          "Title": "Relics",
          "Season": 6,
          "Episode": 4,
          "Notes": "Impulse engine failure is a critical emergency; loss of impulse threatens the ship’s ability to avoid disaster."
        },
        {
          "RefType": "Episode",
          "Series": "TOS",
          "Title": "The Doomsday Machine",
          "Season": 2,
          "Episode": 6,
          "Notes": "Impulse engines are treated as repairable but dangerous under stress; impulse failure is tied to imminent catastrophe."
        },
        {
          "RefType": "Episode",
          "Series": "TNG",
          "Title": "The Last Outpost",
          "Season": 1,
          "Episode": 5,
          "Notes": "Impulse engines are shown surging and firing again after system disruptions, emphasizing their sensitivity under attack."
        },
        {
          "RefType": "Episode",
          "Series": "DS9",
          "Title": "Starship Down",
          "Season": 4,
          "Episode": 7,
          "Notes": "Impulse power going off-line creates immediate navigational danger, requiring manual rerouting and repairs."
        }
      ],
      "Variants": [
        {
          "Name": "Impulse power settings",
          "Summary": "Operational shorthand—one‑quarter, half, full impulse—used as a throttle concept rather than a fixed universal speed."
        },
        {
          "Name": "Reverse impulse",
          "Summary": "Bridge-level command for braking, backing off, or holding position by applying impulse thrust in reverse."
        }
      ],
      "KeyTerms": [
        {
          "Term": "Impulse drive",
          "Definition": "Sublight propulsion mode for sustained thrust and ship handling under normal space."
        },
        {
          "Term": "Impulse engines",
          "Definition": "Common shipboard phrasing for the impulse drive system and its engine assemblies."
        },
        {
          "Term": "Impulse power",
          "Definition": "Power allocation/output level applied to the impulse drive, adjusted as conditions demand."
        },
        {
          "Term": "Full impulse",
          "Definition": "Maximum practical impulse output for the ship’s current condition and constraints."
        },
        {
          "Term": "Reverse impulse",
          "Definition": "Applying impulse thrust in reverse for braking, backing, or holding station."
        },
        {
          "Term": "At your discretion",
          "Definition": "A helm instruction indicating the pilot should select an appropriate impulse setting for the situation."
        }
      ],
      "Operators": [
        "Starfleet (Federation starships)",
        "Multiple interstellar fleets (impulse-class sublight propulsion is widespread)"
      ],
      "Constraints": [
        "Impulse output competes with other ship systems for power during combat, damage control, or emergency operations.",
        "Sustained high-output impulse is often treated as stressful or risky, especially when engines or conduits are already damaged.",
        "Impulse power loss can leave a ship effectively unable to maneuver, making it vulnerable to hazards and enemy action.",
        "Environmental conditions and tactical constraints can make warp unsafe or undesirable, forcing reliance on impulse for critical maneuvers."
      ],
      "Meta": {
        "Series": [
          "TOS",
          "TAS",
          "TNG",
          "DS9",
          "VOY",
          "ENT",
          "FILM",
          "PIC",
          "SNW",
          "LDS",
          "PRO",
          "DIS"
        ],
        "Era": [
          "22nd century",
          "23rd century",
          "24th century",
          "25th century",
          "32nd century"
        ],
        "Affiliations": [
          "United Federation of Planets",
          "Starfleet"
        ],
        "FirstSeen": "",
        "LastSeen": ""
      },
      "Media": {
        "Image": "https://raw.githubusercontent.com/BigBird7827/Tec-Trek/main/Images/Impulse%20Engines.png",
        "Gallery": []
      }
    }
  ]
}
